[
  {
    "id": "1",
    "title": "Great Relief for Taxpayers – Reduction in Pre-deposit for Penalty-only Appeals under GST",
    "description": "In a major relief for taxpayers, the Government has reduced the pre-deposit requirement for filing appeals in penalty-only cases under GST. Pursuant to the GST Council's 55th Meeting recommendations, the Finance Act, 2025 amended Sections 107(6) and 112(8) of the CGST Act to lower the pre-deposit from 25% to 10% for appeals before the Appellate Authority, and to prescribe an additional 10% for appeals before the Appellate Tribunal. The amendment, effective 1 October 2025, ensures fair access to justice and eases the compliance burden on small taxpayers and individuals.",
    "pdf_link": "/pdfs/news/gst-pre-deposit-relief.pdf",
    "upload_time": "2025-11-06T10:00:00Z"
  },
  {
    "id": "2",
    "title": "Department for Revenue amended the Notification by inserting conditions and eligibility for taking input tax credit",
    "description": "The Central Board of Indirect Taxes and Customs (CBIC) has issued significant amendments to the notification regarding input tax credit (ITC) under Section 16 and Section 148 of the CGST Act. These amendments introduce new conditions and eligibility criteria that registered taxpayers must comply with to avail ITC. The notification aims to streamline the ITC claiming process and prevent misuse of the credit system. Businesses are advised to review their compliance procedures to ensure adherence to the new requirements.",
    "pdf_link": "/pdfs/news/itc-amendment-notification.pdf",
    "upload_time": "2025-10-20T14:30:00Z"
  },
  {
    "id": "3",
    "title": "Supreme Court Ruling on Customs Duty Classification of Imported Machinery",
    "description": "The Supreme Court of India has delivered a landmark judgment clarifying the classification of imported machinery under customs duty schedules. The ruling provides much-needed clarity on the interpretation of technical specifications and their impact on duty rates. This decision is expected to affect numerous pending cases and will serve as a guiding precedent for customs authorities and importers alike. The court emphasized the need for consistent application of classification principles across all ports.",
    "pdf_link": "/pdfs/news/supreme-court-customs-ruling.pdf",
    "upload_time": "2025-09-15T09:15:00Z"
  },
  {
    "id": "4",
    "title": "New FEMA Guidelines for Foreign Investment in LLPs",
    "description": "The Reserve Bank of India has issued updated Foreign Exchange Management Act (FEMA) guidelines concerning foreign investment in Limited Liability Partnerships (LLPs). The new guidelines clarify permissible sectors, investment routes, and reporting requirements. These changes aim to facilitate foreign investment while maintaining regulatory oversight. LLPs and foreign investors must ensure compliance with the updated framework, including filing requirements and sectoral caps. The guidelines come into effect from the next financial year.",
    "pdf_link": "/pdfs/news/fema-llp-guidelines.pdf",
    "upload_time": "2025-08-28T11:45:00Z"
  },
  {
    "id": "5",
    "title": "National Green Tribunal Issues Stricter Environmental Compliance Norms",
    "description": "The National Green Tribunal (NGT) has introduced more stringent environmental compliance norms for industries across multiple sectors. The new directives require enhanced monitoring, regular audits, and stricter penalties for non-compliance. Industries must now submit comprehensive environmental impact assessments and implement real-time emission monitoring systems. The NGT has given a six-month window for industries to comply with the new norms, after which strict action will be taken against violators.",
    "pdf_link": "/pdfs/news/ngt-compliance-norms.pdf",
    "upload_time": "2025-07-12T16:20:00Z"
  },
  {
    "id": "6",
    "title": "NCLT Introduces E-Filing System for Corporate Insolvency Cases",
    "description": "The National Company Law Tribunal (NCLT) has launched a new electronic filing system specifically designed for corporate insolvency and restructuring cases. The e-filing platform aims to reduce processing time, improve transparency, and facilitate easier access to case documents. All stakeholders, including resolution professionals, creditors, and legal representatives, can now file applications, affidavits, and other documents online. Training sessions for users are being conducted across all NCLT benches to ensure smooth adoption of the new system.",
    "pdf_link": "/pdfs/news/nclt-efiling-system.pdf",
    "upload_time": "2025-06-05T13:00:00Z"
  }
]
